package com.muhammadalsaied.blog.backend;

import com.muhammadalsaied.blog.backend.dao.ArticleDao;
import com.muhammadalsaied.blog.backend.dao.CategoryDao;
import com.muhammadalsaied.blog.backend.dao.TagDao;
import com.muhammadalsaied.blog.backend.dao.UserDao;
import com.muhammadalsaied.blog.backend.dto.Article;
import com.muhammadalsaied.blog.backend.dto.Category;
import com.muhammadalsaied.blog.backend.dto.Tag;
import com.muhammadalsaied.blog.backend.dto.User;
import java.util.Date;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.CommandLineRunner;
import org.springframework.stereotype.Component;

/**
 * Created by @author Muhammed Alsaied On Nov 9, 2018
 * muhammadalsaied96@gmail.com
 */
@Component
public class Commands implements CommandLineRunner {

    @Autowired
    private UserDao userDao;

    @Autowired
    private CategoryDao categoryDao;

    @Autowired
    private TagDao tagDao;

    @Autowired
    private ArticleDao articleDao;

    @Override
    public void run(String... args) throws Exception {
        User user = new User();
        user.setFirstName("Muhammad");
        user.setLastName("Alsaied");
        user.setEmail("muhammadAlsaied96@gmail.com");
        user.setPassword("pass");
        user.setDescription("My name is Muhammad Alsaeid");
        user.setRole("admin");
        user.setActive(true);
        userDao.save(user);

        Category cat = new Category();
        cat.setName("Programming");
        categoryDao.save(cat);

        Tag tag = new Tag();
        tag.setName("java");
        tagDao.save(tag);

        Article article = new Article();
        article.setTitle("هل انتهت الجي كويري وبلا رجعة؟");
        article.setContent("هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟");
        article.setCategory(cat);
        article.addTag(tag);
        article.setDateCreated(new Date());
        article.setImageUrl("assets\\img\\post-1.jpg");
        article.setUser(user);
        article.setActive(true);
        articleDao.save(article);

        article = new Article();
        article.setTitle("هل انتهت الجي كويري وبلا رجعة؟");
        article.setContent("هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟");
        article.setCategory(cat);
        article.addTag(tag);
        article.setDateCreated(new Date());
        article.setImageUrl("assets\\img\\post-1.jpg");
        article.setUser(user);
        article.setActive(true);
        articleDao.save(article);

        article = new Article();
        article.setTitle("هل انتهت الجي كويري وبلا رجعة؟");
        article.setContent("هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟ هل حقا انتهت الجي كويري؟");
        article.setCategory(cat);
        Tag tag1 = new Tag("aquery");
        tagDao.save(tag1);
        article.addTag(tag1);
        article.setDateCreated(new Date());
        article.setImageUrl("assets\\img\\post-1.jpg");
        article.setUser(user);
        article.setActive(true);
        articleDao.save(article);

    }

}
